Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This method can be used to convert a value property to a dynamic property or vice versa, but it is not possible to specify both a value and accessor functions.
ja: この方法は、バリュープロパティをダイナミックプロパティに、またはその逆に変換するために使用することができますが、バリューとアクセッサ関数の両方を指定することはできません。

source: This method can be used to help performance in cases where multiple files are being read or written simultaneously.
ja: この方法は、複数のファイルを同時に読み書きするような場合に、パフォーマンスを向上させるために使用することができます。

source: This method can be used with the tray menu or any other menu.
ja: この方法は、トレイメニューや他のメニューでも使用できます。

source: This method correctly retrieves the active/topmost child window of an Multiple Document Interface (MDI) application such as SysEdit or TextPad.
ja: SysEditやTextPadなどのMDI（Multiple Document Interface）アプリケーションのアクティブ／最上位の子ウィンドウを正しく取得することができるようになりました。

source: This method does the following:
ja: この方法では、次のようなことができます：

source: This method exists to support Call, and is not intended to be called directly.
ja: このメソッドはCallをサポートするために存在し、直接呼び出すことは意図していません。

source: This method exists to support Call, and is not usually called directly.
ja: このメソッドはCallをサポートするために存在し、通常、直接呼び出されることはありません。

source: This method exists to support menus that don't contain text (perhaps because they contain pictures of text rather than actual text).
ja: この方法は、テキストを含まないメニューをサポートするために存在します（おそらく、実際のテキストではなく、テキストの画像を含むため）。

source: This method installs the keyboard hook (if it was not already).
ja: このメソッドは、キーボードフックをインストールします（まだインストールされていない場合）。

source: This method is about 10% slower than the normal method.
ja: この方法は、通常の方法より10％程度遅くなります。

source: This method is about 10 % slower than the normal method.
ja: この方法は、通常の方法より10 %程度遅くなります。

source: This method is about three times slower than the normal method.
ja: この方法は、通常の方法と比較して約3倍の速度がかかります。

source: This method is automatically created by class definitions; it contains all instance variable initializers defined within the class body.
ja: このメソッドは、クラス定義によって自動的に作成され、クラス本体内で定義されたすべてのインスタンス変数のイニシャライザーを含んでいます。

source: This method is exactly equivalent to GetMethod(Value, Name, ParamCount), unless overridden.
ja: このメソッドは、オーバーライドされていない限り、GetMethod(Value, Name, ParamCount)と全く同じです。

source: This method is exactly equivalent to HasBase(Value, BaseObj), unless overridden.
ja: このメソッドは、オーバーライドされていない限り、HasBase(Value, BaseObj)と全く同じです。

source: This method is exactly equivalent to HasMethod(Value, Name, ParamCount), unless overridden.
ja: このメソッドは、オーバーライドされない限り、HasMethod(Value, Name, ParamCount)と全く同等です。

source: This method is exactly equivalent to HasProp(Value, Name), unless overridden.
ja: このメソッドは、オーバーライドされない限り、HasProp(Value, Name)と全く同等です。

source: This method is necessary in cases where a key or mouse button must be held down for the entire time that you're holding down a controller button.
ja: この方法は、コントローラーのボタンを押している間ずっと、キーやマウスのボタンを押し続けなければならない場合に必要です。

source: This method is necessary in cases where you have more than one controller hotkey of the type described in Method #2, and you sometimes press and release such hotkeys simultaneously.
ja: この方法は、方法#2で説明したタイプのコントローラーホットキーが複数あり、そのようなホットキーを同時に押したり離したりすることがある場合に必要です。

source: This method is normally called prior to adding any rows to the ListView.
ja: このメソッドは通常、ListViewに行を追加する前に呼び出されます。

source: This method is not implemented by default, so must be defined by the script.
ja: このメソッドはデフォルトでは実装されていないので、スクリプトで定義する必要があります。

source: This method is often used in the top line of a Loop, in which case the method would get called only once (prior to the first iteration).
ja: このメソッドはループの先頭行で使われることが多く、その場合、このメソッドは1回だけ（最初の反復の前に）呼び出されることになります。

source: This method is typically not called directly.
ja: このメソッドは通常、直接呼び出されることはありません。

source: This method returns 1 (true) if successful or 0 (false) if there were no items remaining.
ja: このメソッドは成功すれば1 (true)を返し、アイテムが残っていなければ0 (false)を返します。

source: This method sends simple keystrokes and mouse clicks.
ja: この方法は、単純なキー入力やマウスクリックを送信する。

source: This method should return an enumerator which will return items contained by the object, such as array elements.
ja: このメソッドは、配列要素など、オブジェクトに含まれる項目を返す列挙子を返す必要があります。

source: This metric refers to the entire desktop.
ja: この指標はデスクトップ全体を指す。

source: This might also help us and other AutoHotkey users, as the vendor may confirm it is a false positive and fix their product to play nice with AutoHotkey.
ja: ベンダーが誤検出であることを確認し、AutoHotkeyとうまく連携できるように製品を修正するかもしれないので、これは私たちや他のAutoHotkeyユーザーにとっても役立つかもしれません。

source: This might increase the maximum recursion depth of user-defined functions.
ja: これにより、ユーザー定義関数の最大再帰深度が増加する可能性があります。

source: This might not be the function's fault if the script passed it an unsuitable value such as a bad pointer or a "str" with insufficient capacity.
ja: これは、スクリプトが不正なポインタや容量不足の"str"のような不適切な値を渡した場合、関数の責任ではないかもしれません。

source: This might result in the last line ending in a naked carriage return (`r) rather than `r`n.
ja: その結果、最終行の末尾が `r`n ではなく、裸のキャリッジリターン (`r) になってしまうかもしれません。

source: This mode blocks all user inputs unconditionally.
ja: すべてのユーザー入力を無条件でブロックするモードです。

source: This mode can be combined with the Blind mode to avoid releasing any modifier keys:
ja: このモードは、ブラインドモードと組み合わせることで、修飾キーを離さないようにすることができます：

source: This mode can be combined with the Blind mode to avoid releasing any modifier keys: Send "{Blind}{Text}your text".
ja: このモードは、ブラインドモードと組み合わせることで、修飾キーを離さないようにすることができます：Send "{Blind}{Text}テキスト"。

source: This mode only blocks the mouse cursor movement.
ja: このモードは、マウスカーソルの移動のみをブロックします。

source: This mode only blocks user inputs while specific send and/or mouse functions are in progress.
ja: このモードは、特定の送信および/またはマウス機能の実行中にのみ、ユーザー入力をブロックします。

source: This mode predates the addition of Try/Catch to the language.
ja: このモードは、言語にTry/Catchが追加される以前からありました。

source: This must start with HKEY_LOCAL_MACHINE (or HKLM), HKEY_USERS (or HKU), HKEY_CURRENT_USER (or HKCU), HKEY_CLASSES_ROOT (or HKCR), or HKEY_CURRENT_CONFIG (or HKCC).
ja: キーは、HKEY_LOCAL_MACHINE（または HKLM）、HKEY_USERS（または HKU）、HKEY_CURRENT_USER（または HKCU）、HKEY_CLASSES_ROOT（または HKCR）、またはHKEY_CURRENT_CONFIG（または HKCC）で始まらなければなりません。

source: This must start with HKEY_LOCAL_MACHINE, HKEY_USERS, HKEY_CURRENT_USER, HKEY_CLASSES_ROOT, or HKEY_CURRENT_CONFIG (or the abbreviations for each of these, such as HKLM).
ja: HKEY_LOCAL_MACHINE、HKEY_USERS、HKEY_CURRENT_USER、HKEY_CLASSES_ROOT、HKEY_CURRENT_CONFIG（またはHKLMなど、それぞれの略称）で始まる必要があります。

source: This name does not change even if a new picture file name is specified.
ja: この名前は、新しい画像ファイル名が指定されても変わりません。

source: This name does not change even if the Hotstring function later accesses the hotstring with different option characters.
ja: この名前は、後にHotstring関数が異なるオプション文字でHotstringにアクセスしても、変更されることはありません。

source: This name is shared by all variants of the hotkey, and does not change even if the Hotkey function later accesses the hotkey with a different symbol ordering.
ja: この名前は、ホットキーのすべてのバリエーションで共有され、ホットキー機能が後で異なるシンボル順序でホットキーにアクセスしても変更されることはありません。

source: This number can be unquoted if is the only option.
ja: この数字は、唯一の選択肢であるならば、引用されないことも可能です。

source: This object has methods and properties which replace the Gui sub-commands.
ja: このオブジェクトは、Guiのサブコマンドを置き換えるメソッドとプロパティを持ちます。

source: This object has multiple uses:
ja: このオブジェクトは複数の用途：

source: This object has the following methods and properties:
ja: このオブジェクトは、以下のメソッドとプロパティを持ちます：

source: This occurs automatically for run-once timers, but can also be done by calling SetTimer with a Period of 0.
ja: これはランワンスタイマーでは自動的に行われますが、SetTimerをPeriodを0にして呼び出すことによっても行うことができます。

source: This occurs whenever there are no enabled hotkeys for a given prefix.
ja: この現象は、指定したプリフィクスに対して有効なホットキーがない場合に発生します。

source: This one can be moved/hidden too.
ja: こちらも移動/非表示が可能。

source: This one should tell us a few things:
ja: この一枚で、いくつかのことがわかるはずだ：

source: This only applies to menu bars, not popup menus or submenus.
ja: これはメニューバーだけに適用され、ポップアップメニューやサブメニューには適用されません。

source: This only applies to WinWait and WinWaitClose; for other windowing functions, specifying a pure HWND causes hidden windows to be detected regardless of DetectHiddenWindows.
ja: これは、WinWaitとWinWaitCloseにのみ適用されます。他のウィンドウ関数の場合、pure HWNDを指定すると、DetectHiddenWindowsに関係なく隠しウィンドウが検出されます。

source: This only applies to FileObj.Encoding, not FileOpen.
ja: これはFileObj.Encodingにのみ適用され、FileOpenには適用されません。

source: This operation is generally equivalent to HasBase(Value, Class.Prototype).
ja: この操作は一般的にHasBase(Value, Class.Prototype)と等価です。

source: This operator is a shorthand replacement for the if-else statement.
ja: この演算子は、if-else文に代わる省略記法である。

source: This operator is currently supported only for variables.
ja: この演算子は現在、変数に対してのみサポートされている。

source: This optimization applies to expressions which contain a single call to WinActive or WinExist with up to two parameters, where each parameter is a simple quoted string and the result is optionally inverted with ! or not.
ja: この最適化は、WinActiveまたはWinExistへの単一の呼び出しと最大2つのパラメータを含む式に適用され、各パラメータは単純な引用文字列で、結果はオプションで! または notで反転されます。

source: This optimization improved performance of scripts with more than 100,000 variables.
ja: この最適化により、100,000以上の変数を持つスクリプトのパフォーマンスが改善されました。

source: This optimizes for chained base/superclass calls and (in combination with MaxParams validation) encourages authors to handle the args.
ja: これは、連鎖するベース/スーパークラスの呼び出しを最適化し、（MaxParamsの検証との組み合わせで）作者に引数を処理することを奨励します。

source: This option accepts a one-based icon number, but this is internally translated to a zero-based index; therefore, Icon0 corresponds to the constant I_IMAGECALLBACK, which is normally defined as -1, and Icon-1 corresponds to I_IMAGENONE.
ja: このオプションは1ベースのアイコン番号を受け付けるが、これは内部的に0ベースのインデックスに変換される。したがって、アイコン0は定数I_IMAGECALLBACK（通常は-1として定義される）に対応し、アイコン-1はI_IMAGENONEに対応する。

source: This option affects the following controls:
ja: このオプションは、以下のコントロールに影響します：

source: This option affects the following controls: Text, Edit, Button, CheckBox, Radio, Slider, GroupBox.
ja: このオプションは、以下のコントロールに影響します：Text、Edit、Button、CheckBox、Radio、Slider、GroupBox。

source: This option affects the following controls: Text, Edit, Button, CheckBox, Radio, UpDown, Slider, Tab, Tab2, GroupBox, DateTime, Link.
ja: このオプションは、以下のコントロールに影響します：Text、Edit、Button、CheckBox、Radio、UpDown、Slider、Tab、Tab2、GroupBox、DateTime、Link。

source: This option affects the following controls: Text, Edit, Button, CheckBox, Radio, UpDown, Slider, Tab, Tab2, GroupBox, DateTime.
ja: このオプションは、以下のコントロールに影響します：Text、Edit、Button、CheckBox、Radio、UpDown、Slider、Tab、Tab2、GroupBox、DateTime。

source: This option also prevents navigation into a folder via a folder shortcut.
ja: また、このオプションは、フォルダーショートカットによるフォルダーへのナビゲーションを防止します。

source: This option can be used to override the window's current theme setting for the newly created control.
ja: このオプションを使用すると、ウィンドウの現在のテーマ設定を、新しく作成されたコントロールに上書きすることができます。

source: This option causes all other options except D, Z, and U to be ignored (though N, C, and CL still affect how duplicates are detected).
ja: このオプションは、D、Z、U以外のすべてのオプションを無視する（ただし、N、C、CLは重複の検出方法に影響を与える）。

source: This option has an effect only when creating a TreeView (however, the SetImageList method does not have this limitation).
ja: このオプションはTreeViewを作成するときにのみ効果があります（ただし、SetImageListメソッドには、この制限はありません）。

source: This option has no effect if the Classic Theme is in effect.
ja: このオプションは、「クラシックテーマ」が有効な場合は効果がありません。

source: This option has no effect when not in Report (Details) view.
ja: このオプションは、レポート（詳細）ビューでない場合は効果がありません。

source: This option helps reserve unused backslash sequences for future use.
ja: このオプションは、未使用のバックスラッシュ・シーケンスを将来の使用のために確保するのに役立つ。

source: This option is generally required for reading binary data because by default, any bytes read from file are interpreted as text and may be converted from the source file's encoding (as specified in the options or by A_FileEncoding) to the script's native encoding, UTF-16.
ja: なぜなら、デフォルトでは、ファイルから読み込まれたバイトはテキストとして解釈され、ソースファイルのエンコーディング（オプションまたはA_FileEncodingで指定）からスクリプトのネイティブエンコーディングであるUTF-16に変換されることがあるからです。

source: This option is ignored by 64-bit versions of AutoHotkey, which use the x64 calling convention.
ja: このオプションは、x64呼び出し規約を使用するAutoHotkeyの64ビットバージョンでは無視されます。

source: This option is ignored for joystick buttons.
ja: ジョイスティックボタンの場合、このオプションは無視されます。

source: This option is ignored when the "m" option is present.
ja: "m"オプションがある場合、このオプションは無視される。

source: This option is put into effect automatically for hotstrings that have a continuation section.
ja: このオプションは、継続セクションを持つホットストリングに自動的に適用されます。

source: This option is typically more effective when used with the Modify method than with the Add method.
ja: このオプションは通常、AddメソッドよりもModifyメソッドで使用した方が効果的です。

source: This option is useful for sorting bare filenames (i.e. excluding their paths), such as the example below, in which the AAA.txt line is sorted above the BBB.txt line because their directories are ignored for the purpose of the sort:
ja: このオプションは、以下の例のように、（パスを除いた）素のファイル名をソートするのに便利です。この例では、AAA.txt行がBBB.txt行の上にソートされるが、これはソートの目的上、これらのディレクトリが無視されるからです：

source: This option is valid only when W and H are present.
ja: このオプションは、Wと Hが存在する場合にのみ有効である。

source: This option makes it easier to find a match by specifying one color within the image that will match any color on the screen.
ja: このオプションは、画面上のどの色とも一致するような色を画像内で1つ指定することで、一致する色を見つけやすくするものです。

source: This option overrides any previously specified encoding and vice versa.
ja: このオプションは、以前に指定されたエンコーディングを上書きし、その逆もまた然りです。

source: This option should be used only if the script is capable of executing despite the failure, such as if the DLL or EXE is non-essential, or if the script is designed to detect the failure.
ja: このオプションは、DLLやEXEが必須でないなど、障害があってもスクリプトが実行できる場合、またはスクリプトが障害を検出するように設計されている場合にのみ使用する必要があります。

source: This option should be used only when the file's contents are not essential to the main script's operation.
ja: このオプションは、ファイルの内容がメインスクリプトの動作に不可欠でない場合にのみ使用してください。

source: This option should be used only when the included file's contents are not essential to the main script's operation.
ja: このオプションは、インクルードされたファイルの内容がメインスクリプトの動作に不可欠でない場合にのみ使用する必要があります。

source: This option should not be present if the D option is already present (and vice versa).
ja: Dオプションがすでに存在する場合、このオプションは存在してはならない（その逆も同様）。

source: This option should not be used with the Hotstring function.
ja: このオプションは、Hotstring関数と一緒に使用しないでください。

source: This option works even after the window is created.
ja: このオプションは、ウィンドウを作成した後でも機能します。

source: This optional parameter is a reference to the output variable in which to store the unique ID number of the window under the mouse cursor.
ja: このオプションのパラメータは、マウスカーソルの下にあるウィンドウの固有のID番号を格納する出力変数への参照です。

source: This optional parameter is a reference to the output variable in which to store the name (ClassNN) of the control under the mouse cursor.
ja: このオプションパラメータは、マウスカーソル下のコントロールの名前（ClassNN）を格納する出力変数への参照です。

source: This optional parameter is an integer between -2147483648 and 2147483647 (or an expression) to indicate this timer's thread priority.
ja: このオプションのパラメータは、このタイマーのスレッド優先度を示す-2147483648から2147483647の間の整数（または式）である。

source: This overrides VisibleText or VisibleNonText until -S is used.
ja: -Sが使用されるまでは、VisibleTextまたはVisibleNonTextに優先します。

source: This overrides VisibleText or VisibleNonText until -V is used.
ja: -Vが使用されるまで、VisibleTextまたはVisibleNonTextをオーバーライドします。

source: This page contains information about the currently used version, the authors, the license, and a quick overview of the documentation.
ja: このページでは、現在使用しているバージョン、作者、ライセンス、ドキュメントの簡単な概要についての情報を掲載しています。

source: This page contains the functions to modify it.
ja: このページには、それを変更するための機能が含まれています。

source: This page contains the methods to modify it.
ja: このページでは、その修正方法をご紹介します。

source: This page covers options, commonly used symbols and syntax which can be used inside a regular expression.
ja: このページでは、正規表現内で使用できるオプション、よく使われる記号、構文について説明します。

source: This page explains how to send messages to a window or its controls via PostMessage or SendMessage and will answer some questions like:
ja: このページでは、PostMessageや SendMessageを使ってウィンドウやそのコントロールにメッセージを送る方法を説明し、以下のような質問に答える：

source: This page lists all mouse buttons, keyboard keys and controller buttons which can be used for hotkeys and key-specific functions.
ja: このページでは、ホットキーやキー固有の機能に使用できるすべてのマウスボタン、キーボードキー、コントローラボタンの一覧を表示します。

source: This page lists all mouse buttons, keyboard keys and joystick buttons which can be used for hotkeys and key-specific functions.
ja: このページでは、ホットキーやキー固有の機能を利用できるマウスボタン、キーボードキー、ジョイスティックボタンを一覧で紹介します。

source: This page lists criteria that can be used in the WinTitle parameter of built-in functions to determine the target window(s).
ja: このページでは、組み込み関数の WinTitle パラメータで使用できる、ターゲット・ウィンドウを決定するための基準を示します。

source: This page lists functions for performing the following operations on a process:
ja: このページでは、プロセスに対して以下の操作を行うための機能を掲載しています：

source: This page lists functions for retrieving information about one or more windows or for performing various operations on a window.
ja: このページでは、ウィンドウに関する情報を取得したり、ウィンドウに対してさまざまな操作を実行したりするための関数の一覧を示します。

source: This page lists functions for retrieving information about the computer's drive(s) or for performing various operations on a drive.
ja: このページでは、コンピュータのドライブに関する情報を取得したり、ドライブに対してさまざまな操作を実行したりするための関数を表示します。

source: This page lists functions for retrieving screen resolution and multi-monitor info.
ja: 画面解像度やマルチモニター情報を取得するための関数を掲載しています。

source: This page lists functions for retrieving various types of information about the computer's drive(s), or making a variety of changes to a drive.
ja: このページでは、コンピュータのドライブに関するさまざまな情報を取得したり、ドライブにさまざまな変更を加えたりするための機能を紹介しています。

source: This page lists functions to retrieve information about a control, or make a variety of changes to a control.
ja: このページでは、コントロールに関する情報を取得したり、コントロールにさまざまな変更を加えたりするための機能を一覧で紹介します。

source: This page lists functions to retrieve information about one or more windows, or make a variety of changes to a window.
ja: このページでは、1つまたは複数のウィンドウに関する情報を取得したり、ウィンドウにさまざまな変更を加えたりするための関数を紹介します。

source: This page lists questions and answers about general troubleshooting, common tasks, hotkeys, hotstrings and remapping.
ja: このページでは、一般的なトラブルシューティング、一般的なタスク、ホットキー、ホットストリング、リマッピングに関するQ&Aを掲載しています。

source: This page lists some debugging clients or UIs known to be compatible with AutoHotkey.
ja: このページには、AutoHotkeyと互換性があることがわかっているデバッグクライアントまたはUIがいくつかリストされています。

source: This page lists some styles and extended styles which can be set or retrieved with Gui or GuiControl object's Opt method, WinSetStyle, WinGetStyle, ControlSetStyle and ControlGetStyle.
ja: このページでは、GuiまたはGuiControlオブジェクトのOptメソッド、WinSetStyle、WinGetStyle、ControlSetStyle、ControlGetStyleで設定または取得できるスタイルと拡張スタイルの一覧を示します。

source: This page lists some styles and extended styles which can be set or retrieved with the methods Gui.Opt and GuiControl.Opt, and with the built-in functions WinSetStyle, WinSetExStyle, WinGetStyle, WinGetExStyle, ControlSetStyle, ControlSetExStyle, ControlGetStyle and ControlGetExStyle.
ja: このページでは、Gui.OptメソッドとGuiControl.Optメソッド、および組み込み関数のWinSetStyle、WinSetExStyle、WinGetStyle、WinGetExStyle、ControlSetStyle、ControlSetExStyle、ControlGetStyle、ControlGetExStyleで、設定または取得できるスタイルと拡張スタイルの一覧を示します。

source: This page lists some windows messages used by the PostMessage, SendMessage and OnMessage functions.
ja: このページでは、PostMessage関数、SendMessage関数、OnMessage関数で使用されるウィンドウズ・メッセージについて説明します。

source: This parameter can also be one of the following special values:
ja: このパラメータは、以下の特別な値のいずれかを指定することも可能です：

source: This parameter can be left blank if KeyName already exists as a hotkey, in which case its action will not be changed.
ja: KeyNameがすでにホットキーとして存在する場合は、このパラメータを空白にすることができ、その場合、その動作は変更されません。

source: This parameter can be omitted if the hotstring already exists, in which case its replacement will not be changed.
ja: ホットストリングが既に存在する場合は、このパラメータを省略することができ、その場合、その置換は変更されません。

source: This parameter can be the title or partial title of the window, and/or any other criteria described on this page.
ja: このパラメータには、ウィンドウのタイトルまたは部分的なタイトル、および/またはこのページで説明されているその他の基準を指定することができます。

source: This parameter can contain any of the options supported by Gui.Opt.
ja: このパラメータには、Gui.Optがサポートする任意のオプションを含めることができます。

source: This parameter determines whether to overwrite files if they already exist.
ja: このパラメータは、ファイルがすでに存在する場合に上書きするかどうかを決定します。

source: This parameter determines whether to recurse into subdirectories.
ja: このパラメータは、サブディレクトリに再帰するかどうかを決定します。

source: This parameter is generally not explicitly present in languages which natively support interfaces, but is shown in the C style "Vtbl" definition.
ja: このパラメータは、一般にインターフェースをネイティブにサポートする言語では明示的に存在しないが、Cスタイルの「Vtbl」定義では表示されます。

source: This parameter is helpful if the color sought is not always exactly the same shade.
ja: このパラメータは、求める色が常に全く同じ色合いでない場合に有効です。

source: This parameter is helpful if the coloring of the image varies slightly or if ImageFile uses a format such as GIF or JPG that does not accurately represent an image on the screen.
ja: このパラメータは、イメージの色合いが微妙に異なる場合や、ImageFileがGIFやJPGなど、画面上のイメージを正確に表現できないフォーマットを使用している場合に有効です。

source: This parameter is ignored when retrieving joystick status.
ja: ジョイスティックの状態を取得する場合、このパラメータは無視されます。

source: This parameter is not shown in the parameter lists in this documentation.
ja: このパラメータは、本書のパラメータ一覧には表示されていません。

source: This parameter is required when creating a new item, but optional when updating the Options of an existing item.
ja: このパラメータは、新規にアイテムを作成する場合は必須ですが、既存のアイテムのOptionsを更新する場合はオプションです。

source: This parameter may also consist solely of an integer, which is interpreted as the address of the function to call.
ja: このパラメータは、呼び出す関数のアドレスとして解釈される整数値のみからなることもあります。

source: This parameter may be omitted, in which case it defaults to Left.
ja: このパラメータは省略可能であり、その場合、デフォルトはLeftとなります。

source: This parameter may contain zero or more of the following words.
ja: このパラメータには、以下の単語を0個以上含めることができます。

source: This parameter must be a quoted literal string (not a variable or any other expression), and must be listed to the right of the function name FileInstall (that is, not on a continuation line beneath it).
ja: このパラメータは、引用符で囲まれたリテラル文字列（変数やその他の式ではない）でなければならず、関数名FileInstallの右側に記載する必要があります（つまり、その下の継続行に記載してはいけません）。

source: This parameter must be blank or omitted if the "D" option is present.
ja: 「D」オプションがある場合、このパラメータは空白または省略する必要があります。

source: This parameter must be either given a non-empty value or completely omitted.
ja: このパラメータには、空でない値を与えるか、完全に省略する必要があります。

source: This parameter should be 1 for the first entry, 2 for the second, etc.
ja: このパラメータは、最初のエントリーの場合は1、2番目のエントリーの場合は2、などとします。

source: This parameter should be 1 for the first tab, 2 for the second, etc.
ja: このパラメータは、1番目のタブには1、2番目のタブには2、などとします。

source: This parameter should be omitted except when return is used inside a function.
ja: 関数内部でreturnが使用される場合を除き、このパラメータは省略されるべきです。

source: This places a screenshot on the clipboard.
ja: クリップボードにスクリーンショットを配置します。

source: This practice avoids the need for DllCall to internally call LoadLibrary and FreeLibrary each time.
ja: この方法によって、DllCallが内部でLoadLibraryとFreeLibraryを毎回呼び出す必要を回避することができます。

source: This prefix affects all variants of the hotkey and cannot be removed.
ja: この接頭辞は、ホットキーのすべてのバリエーションに影響し、削除することはできません。

source: This prefix must be written after the + or - sign, if present, and before any leading zeroes.
ja: この接頭辞は、+または-記号がある場合はその後に、先行するゼロの前に書かなければならない。

source: This preserves the ability to differentiate between strings and pure numbers (such as with the Type function, or when passing values to COM objects).
ja: これにより、文字列と純粋な数値を区別する機能が維持されます（Type関数や、COMオブジェクトに値を渡す場合など）。

source: This prevents AutoHotkey from suppressing the normal function of Numpad0, unless you have also defined Numpad0::, in which case the tilde allows the latter hotkey to activate immediately instead of when you release Numpad0.
ja: ただし、Numpad0::も定義している場合は、チルダによって、Numpad0を離したときではなく、後者のホットキーがすぐに有効になるようにします。
